app/controllers/boards_controller.rb

  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page])
---
SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`

  def create
    board = Board.new(board_params)
    if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('i', 'ii', 'iiiii', '2021-09-05 16:38:42', '2021-09-05 16:38:42')

  def update
    if @board.update(board_params)
---
UPDATE `boards` SET `name` = 'uuuuuuuuuuuu_name編集', `title` = 'uuuuuuuuuuuuuu_title編集', `body` = 'uuuuuuuuuuuuuu\r\nuuuuuuuuuuuuuu\r\nuuuuuuuuuuuuuu編集', `updated_at` = '2021-09-07 17:10:22' WHERE `boards`.`id` = 3

  def destroy
    @board.destroy
---
DELETE FROM `boards` WHERE `boards`.`id` = 4

  def set_target_board
    @board = Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 4 LIMIT 1